src/cf/InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязиКонтрагентЛид/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавить новую связь и очистить все старые
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//  Лид - СправочникСсылка.Лиды
//  Заказ - Неопределено, ДокументСсылка.ЗаказПокупателя
//
Процедура НоваяСвязь(Контрагент, Лид, Заказ = Неопределено) Экспорт
	
	УдалитьСвязи(Лид);
	
	МенеджерЗаписи = РегистрыСведений.СвязиКонтрагентЛид.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Лид = Лид;
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Очистить все связи лида с контрагентами
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//
Процедура УдалитьСвязи(Лид) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязиКонтрагентЛид.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Добавление заказа в существующую связь
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  Контрагент - СправочникСсылка.Контрагенты
//  Заказ - ДокументСсылка.ЗаказПокупателя
//
Процедура ДобавитьЗаказВСвязь(Лид, Контрагент, Заказ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СвязиКонтрагентЛид.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Лид = Лид;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЛидПоЗаказу(Заказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СвязиКонтрагентЛид.Лид КАК Лид
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|ГДЕ
		|	СвязиКонтрагентЛид.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Лид;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаказПоЛиду(Лид) Экспорт
	
	Если Не ЗначениеЗаполнено(Лид) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СвязиКонтрагентЛид.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|ГДЕ
		|	СвязиКонтрагентЛид.Лид = &Лид";
	
	Запрос.УстановитьПараметр("Лид", Лид);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Заказ;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция СвязьПоЛиду(Лид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязиКонтрагентЛид.Контрагент КАК Контрагент,
		|	СвязиКонтрагентЛид.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|ГДЕ
		|	СвязиКонтрагентЛид.Лид = &Лид";
	
	Запрос.УстановитьПараметр("Лид", Лид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
